kb1c/src/InformationRegisters/НастройкиБазыЗнаний/НастройкиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиБазыЗнаний</name>
  <resources>
    <name>ЗначениеСсылка</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСтрока</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИмяРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

kb1c/src/InformationRegisters/НастройкиБазыЗнаний/Forms/ФормаЗаписи/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ЗначениеСсылка.Видимость	= (Запись.ИмяРесурса = "ЗначениеСсылка");
	Элементы.ЗначениеСтрока.Видимость	= (Запись.ИмяРесурса = "ЗначениеСтрока");
	Элементы.ЗначениеЧисло.Видимость	= (Запись.ИмяРесурса = "ЗначениеЧисло");
	Элементы.ЗначениеБулево.Видимость	= (Запись.ИмяРесурса = "ЗначениеБулево");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ИмяНастройкиПриИзменении(Элемент)
	Если Настройки.Свойство(Запись.ИмяНастройки) Тогда
		ПараметрыНастройки	= Настройки[Запись.ИмяНастройки];
		Запись.ИмяРесурса	= ПараметрыНастройки.ИмяРесурса;
		Если Запись.ИмяРесурса = "ЗначениеСсылка" Тогда
			Запись.ЗначениеСсылка = ПараметрыНастройки.Типы.ПривестиЗначение(Неопределено);
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеСсылкаОчистка(Элемент, СтандартнаяОбработка)
	Если Настройки.Свойство(Запись.ИмяНастройки) Тогда
		ПараметрыНастройки	= Настройки[Запись.ИмяНастройки];
		Если Запись.ИмяРесурса = "ЗначениеСсылка" Тогда
			Запись.ЗначениеСсылка = ПараметрыНастройки.Типы.ПривестиЗначение(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщиеНастройки = БазаЗнанийКлиентСерверПовтИсп.ПолучитьСтруктуруОбщихНастроекБазыЗнаний();
	Для Каждого КлючИЗначение Из ОбщиеНастройки Цикл
		Элементы.ИмяНастройки.СписокВыбора.Добавить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ
